[{"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "Apple late 2023 Macbook Pro 512GB", "review contents": "The device is very slim and not very heavy. The Display is very Beautiful, sharp and clear. Additionally the system is very responsive and moves fast. Overall a wonderful product, but keep in mind how much storage space you may need before you select which one to purchase."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "Excellent product.", "review contents": "I had a MacBook Pro i7 16, and I decided to change for the M3, and in general I see great significant changes in performance and processing. The focus is more on software development, which is my job. Although I have seen many reviews, regarding its predecessors such as the M1 and M2 I would think that if you think about changing for this one, it is better to wait a bit since the change is not so big. But if you have a MacBook Pro with intel processors, I do recommend making the switch. At least in terms of development it is excellent, as long as you opt for this M3 version with 16 ram. I have been using it for 2 months now and everything is normal in relation to the battery, very demanding in performance. I could not say much for other areas such as design or video, but it is a great option."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "Great laptop", "review contents": "Does everything well. Very happy with the unit."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "Fast and elegant", "review contents": "Fast and easy to use. The keyboard is excellent. The screen is superb!\nDownside. I should have gone for 1TB internal. I use external USB 3.1 flash drives\nI will be using it extensively with Photoshop and Lightroom\nI may rekindle my old 3D hobby with Poser and Zbrush"}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "This company stole my money", "review contents": "Don’t buy from this company. They didn’t honor refunding this purchased. The product received required a call to Apple Support. According to Apple Support the unit had a bad hard drive and recommended replacing it since it was < 6 days old. There is nowhere in the universe the consumer is responsible for a manufactured defect despite the seller.\n\nThis seller partially refunded the amount but still owes me over $500 and would not respond to my emails. I just started my small business and I bought this laptop for my business. I am still owed a substantial amount of funds. I do not recommend this seller. I have since purchased this exact MacBook from the Apple Store and it is an amazing machine."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "What a beautiful piece of technology oh my gosh", "review contents": "I bought this because my employer gave me an M2 when I needed accessibility assistance because the regular windows computers work like crap. Especially Dells. I fell in love with the new computer from my employer it was Christmas and I ended up spending my bonus on an M3. It's an amazing amazing device. You can't go wrong it's just very expensive."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "The best MacBook Pro till date", "review contents": "I really like how smooth this machine works, its new space black color and how fast the new M3 chip is.\nI have been using MacBooks for the past 10 Years and this is easily by far the best MacBook I have ever used."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "Excellent laptop.", "review contents": "Playing Baldurs Gate 3. Fans never came on or got very hot, nice. Use it for other projects also."}, {"product title": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 12‑core CPU, 18‑core GPU: 16.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage. Works with iPhone/iPad; Space Black", "review title": "Excellent, for business and photo editing", "review contents": "This version is not the M3 Max version that I originally was going to purchase, but the M3 Pro with 32GB of RAM and 512GB SSD. I thought it might be too heavy as I have the 15\" MacBook Air as well, but it is slightly heavier than my 15\" Dell XPS laptop which this is replacing. Great screen, Mini LCD, which is close to the OLED on my Dell XPS 15.\n\nRecommended"}]